---
kind: type
id: T:Autodesk.Revit.DB.Electrical.ElectricalPhaseConfiguration
source: html/fa91ef24-f277-a8b8-822c-7ec5fc076035.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalPhaseConfiguration

An enumerated type to specify the electrical phase configuration.

## Syntax (C#)
```csharp
public enum ElectricalPhaseConfiguration
```